html/blogs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head><!-- Global site tag (gtag.js) - Google Analytics --><meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>个人博客 Blogs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="work" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="/themes/styles/readtheorg/css/readtheorg.css"/></head>
<body>
<div id="content">
<h1 class="title">个人博客 Blogs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org980d777">1. 2019</a></li>
<li><a href="#orga8cd485">2. 2018</a></li>
<li><a href="#org82bf144">3. 2017</a></li>
<li><a href="#org27b1804">4. 2016</a></li>
<li><a href="#org87e0dc1">5. 2015</a></li>
<li><a href="#org9220a58">6. 2014</a></li>
<li><a href="#org353a0c6">7. 2013</a></li>
<li><a href="#org5498c60">8. 2012</a></li>
<li><a href="#org0b4fd0e">9. misc</a></li>
<li><a href="#org31cea81">10. links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org980d777" class="outline-2">
<h2 id="org980d777"><span class="section-number-2">1</span> 2019</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>201903 <a href="strangler-application.html">StranglerApplication</a> 扼杀者应用（如何有效安全地替换掉老的应用）</li>
<li>201903 <a href="pitalls-of-python-ecosystem.html">Python生态系统里的各种陷阱</a></li>
<li>201903 <a href="instagram-under-the-hood.html">Instagram Under the Hood</a></li>
<li>201903 <a href="running-sentry-on-ec2.html">在AWS EC2上启动Sentry</a></li>
<li>201902 <a href="tour-of-forbidden-city-on-festival-day.html">春节逛圈故宫</a></li>
<li>201902 <a href="lucky-to-have-someone-to-share.html">能找到一个人分享是多么难得的事情</a></li>
<li>201901 <a href="instagram-engineering-3-rules-to-a-scalable-cloud-application-architecture.html">Instagram Engineering’s 3 rules to a scalable cloud application architecture</a></li>
<li>201901 <a href="geekbang-tech-and-business-cases.html">极客时间|技术与商业案例解读 文章目录</a></li>
<li>201901 <a href="geekbang-ai-internal-reference.html">极客时间|AI技术内参 文章目录</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga8cd485" class="outline-2">
<h2 id="orga8cd485"><span class="section-number-2">2</span> 2018</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>201812 <a href="geekbang-recommender-system.html">极客时间|推荐系统36式 文章目录</a></li>
<li>201812 <a href="geekbang-tech-management-class.html">极客时间|朱赟的技术管理课 文章目录</a></li>
<li>201812 <a href="siraj-raval-youtube-channel-index.html">Siraj Raval视频索引</a></li>
<li>201812 <a href="nginx-log-parser-opt.html">nginx日志解析器优化</a></li>
<li>201812 <a href="geekbang-tech-management-practice.html">极客时间|技术管理实战36讲 文章目录</a></li>
<li>201812 <a href="geekbang-mysql-practice.html">极客时间|MySQL实战45讲 文章目录</a></li>
<li>201811 <a href="why-i-quit-google-to-work-for-myself.html">Why I Quit Google to Work for Myself</a></li>
<li>201811 <a href="whats-the-largest-amount-of-bad-code-you-have-ever-seen-work.html">{Ask HN}What's the largest amount of bad code you have ever seen work?</a></li>
<li>201811 <a href="interview-with-gmail-creator-and-y-combinator-partner-paul-buchheit.html">Interview with Gmail Creator Paul Buchheit</a></li>
<li>201811 <a href="the-economics-of-getting-hired-as-a-data-scientist.html">The economics of getting hired as a data scientist</a></li>
<li>201811 <a href="keras-author-on-software-engineering.html">Keras之父写给年轻程序员的33条忠告</a></li>
<li>201810 <a href="writing-system-software-code-comments.html">Writing system software: code comments</a></li>
<li>201810 <a href="github-flow.html">GitHub Flow</a></li>
<li>201810 <a href="fallacies-of-distributed-computing-explained.html">Fallacies of Distributed Computing Explained</a></li>
<li>201810 <a href="whats-a-senior-engineers-job.html">What's a senior engineer's job?</a></li>
<li>201810 <a href="geekbang-coolshell-index.html">极客时间|左耳听风 文章目录</a></li>
<li>201810 <a href="liyongle-youtube-channel-index.html">李永乐老师视频索引</a></li>
<li>201810 <a href="living-in-county.html">深度好文：混在县城</a></li>
<li>201810 <a href="avoiding-burnout.html">Avoiding burnout: lessons learned from a 19th century philosopher</a></li>
<li>201810 <a href="find-lca-using-rmq.html">Find LCA using RMQ</a></li>
<li>201810 <a href="sudoku-solving.html">数独程序求解</a></li>
<li>201809 <a href="segment-tree-for-rmq.html">求解RMQ的线段树实现</a></li>
<li>201809 <a href="klotski-solving.html">华容道程序求解</a></li>
<li>201809 <a href="configure-topcoder-env.html">配置TopCoder环境</a></li>
<li>201808 <a href="etsy-activity-feeds-architecture.html">Etsy Activity Feeds Architecture</a></li>
<li>201808 <a href="protobuf-encoding.html">Protobuf Encoding</a> Protobuf编码方式</li>
<li>201808 <a href="youtube-scalability.html">YouTube Scalability</a> on youtube</li>
<li>201808 <a href="sit-boost-your-tech-career.html">SIT / Boost your tech career</a></li>
<li>201807 <a href="algorithm-design-steps-in-interview.html">如何进行算法设计面试</a> in Hired in Tech</li>
<li>201807 <a href="system-design-steps-in-interview.html">如何进行系统设计面试</a> in Hired in Tech</li>
<li>201807 <a href="lang-detect-and-encoding-detect.html">语言检测和编码检测</a> 一种利用语言检测来做编码检测的可能方法</li>
<li>201807 <a href="aws-overview.html">AWS Overview</a> 官方给出的AWS各种产品介绍，比我简单抓取的 <a href="aws-products.html">AWS Products</a> 要好</li>
<li>201807 <a href="amazon-dynamodb.html">Amazon DynamoDB</a> All Things Distributed</li>
<li>201807 <a href="5-lessons-we-have-learned-using-aws.html">5 Lessons We’ve Learned Using AWS</a> Netflix TechBlog</li>
<li>201807 <a href="how-to-write-a-good-software-design-doc.html">How to write a good software design doc</a></li>
<li>201807 <a href="oh-i-have-seen-this-idea-before.html">oh, I’ve seen this idea before</a> 如何回答这个问题</li>
<li>201806 <a href="aws-products.html">AWS Products</a></li>
<li>201806 <a href="binary-indexed-tree.html">Binary Indexed Tree(Fenwick Tree)</a></li>
<li>201806 <a href="interview-psychological-tricks.html">面试心理技巧(Psychological Tricks)</a></li>
<li>201805 <a href="an-impact-guide-for-engineers.html">An Impact Guide for Engineers</a> 工程师影响力指南</li>
<li>201805 <a href="types-of-scipy-sparse-matrix.html">scipy几种稀疏矩阵表示</a></li>
<li>201805 <a href="tibet-travel.html">西藏(林芝-波密-拉萨)游记</a></li>
<li>201805 <a href="skin-in-the-game-dedao.html">精英日课解读《利益悠关》</a> 摘自得到的《精英日课》</li>
<li>201805 <a href="mastering-study.html">寻常问题的精英解法-如何学习</a> 摘自得到的《精英日课》</li>
<li>201805 <a href="why-turing-is-master.html">计算机领域大人物：艾伦·图灵牛在哪？</a> 摘自得到的《硅谷来信》</li>
<li>201805 <a href="why-study-history.html">为什么学习历史</a> 摘自得到的《硅谷来信》</li>
<li>201804 <a href="ssh-proxycommand-on-ssr.html">ssh proxycommand on ssr</a></li>
<li>201804 <a href="getting-started-elk-beat.html">本地跑跑ELK + Beat(日志收集和指标收集)</a></li>
<li>201803 <a href="nginx-https-redirect-loop.html">nginx的https重定向循环问题</a></li>
<li>201803 <a href="what-habits-make-a-programmer-great.html">What habits make a programmer great?</a> about meta-habit</li>
<li>201803 <a href="how-to-build-your-own-alpha-zero-ai.html">How to build your own AlphaZero AI using Python and Keras</a></li>
<li>201803 <a href="on-being-a-senior-engineer.html">On Being A Senior Engineer</a></li>
<li>201803 <a href="how-the-economic-machine-works-by-ray-dalio.html">How The Economic Machine Works By Ray Dalio</a> 经济机器是如何运行的</li>
<li>201802 <a href="difference-between-poor-rich-on-zhihu.html">你在哪一刻体验到了真正的贫富差距？</a> 摘自知乎回答</li>
<li>201802 <a href="python-weak-perf-matters.html">Python 的低性能问题是无法忽视的</a></li>
<li>201802 <a href="management-actually-is-engineering.html">管理其实是个工程学</a> 摘自得到的《精英日课》</li>
<li>201801 <a href="websocket-and-socketio.html">WebSocket和Socket.IO</a></li>
<li>201801 <a href="intro-quantum-computing.html">量子计算机初探</a></li>
<li>201801 <a href="wechat-auto-jump.html">微信跳一跳的自动化</a></li>
<li>201801 <a href="python-requests-encoding-issue.html">Python Requests库编码问题</a></li>
<li>201801 <a href="minimal-wsgi-app-in-python.html">Minimal WSGI App in Pyton</a></li>
<li>201801 <a href="reading-excel-in-python.html">Reading Excel in Python</a></li>
<li>201801 <a href="find-10-digits-prime-in-consecutive-digits-of-e.html">Find 10 digits prime in consecutive digits of e</a></li>
<li>201801 <a href="26-lessons-from-being-a-developer-at-a-startup.html">26 Lessons From Being a Developer at a Startup</a></li>
</ul>
</div>
</div>
