src/blogs.org
** 2016
- 201612 [[file:face-landmark-detection-dlib.org][dlib's face landmark detection]]
- 201612 [[file:tensorflow-neural-art.org][Tensorflow Neural Art]]
- 201610 [[file:the-times-they-are-changing.org][The Times They Are A-Changin']] by Bob Dylan
- 201610 [[file:level-up-lang-taste.org][讲一件提升语言格调的小事]]
- 201610 [[file:the-effective-engineer-by-edmond-lau.org][The Effective Engineer]]
- 201610 [[file:taking-php-seriously.org][Taking PHP Seriously]]
- 201610 [[file:becoming-cto.org][Becoming CTO]]
- 201610 [[file:purchase-on-rapidssl.org][在RapidSSL上购买SSL证书]]
- 201610 [[file:vinod-khosla-talk.org][Vinod Khosla: Failure does not matter. Success matters.]]
- 201610 [[file:silicon-valley-etiquette.org][Silicon Valley Etiquette]] 硅谷礼仪
- 201610 [[file:chengdu-travel.org][天府之旅]]
- 201609 [[file:mxnet-neural-art.org][MXNet Neural Art]]
- 201609 [[file:a-little-architecture.org][A Little Architecture]]
- 201609 [[file:laws-of-performant-software.org][Laws of Performant Software]]
- 201609 [[file:build-hls-server.org][搭建直播平台]]
- 201609 [[file:stackoverflow-maintenance.org][StackOverflow Maintenance]]
- 201609 [[file:yy-live-on-parenting.org][@杨樾杨樾 老师的育儿直播]]
- 201608 [[file:some-non-casual-thoughts.org][一些想法（关于工作，人生，以及最近做的梦)]]
- 201608 [[file:the-future-of-programming.org][The Future of Programming]] by Bret Victor
- 201608 [[file:what-makes-a-great-software-engineer.org][What Makes A Great Software Engineer?]]
- 201607 [[https://www.evernote.com/shard/s81/sh/b4dc1995-8028-4552-af4c-2696be08fce8/eb429ff5192222c2dce47aa95f0f5766][你不需要忙，你只需要坚持就够了]] by 汤小小
- 201607 [[file:life-is-just-a-moment.org][Life is just a Moment]]
- 201607 [[file:cool-retro-term.org][Cool Retro Term(CRT)]] 复古终端:D
- 201607 [[file:spam-from-apple.org][来自Apple的垃圾邮件]]
- 201606 [[file:america-alone-talk.org][只剩美国:我们眼睁睁看着末日的降临]]
- 201606 [[file:top-10-things-that-makes-you-a-good-programmer.org][Top 10 Things that Makes You a Good Programmer]]
- 201606 [[file:dont-know-what-to-program.org]["I know how to program, but I don't know what to program"]]
- 201606 [[file:how-to-pick-your-battles-on-a-software-team.org][How to Pick Your Battles on a Software Team]]
- 201606 [[file:why-mit-stopped-teaching-SICP.org][为什么MIT停止教授SICP]]
- 201606 [[file:trap-of-startup-side-project.org][軟體工程師的創業陷阱-接案]]
- 201606 [[file:on-facebook-newsfeed.org][Facebook NewsFeed]]
- 201606 [[file:getting-things-done-when-you-are-only-a-grunt.org][Getting Things Done When You're Only a Grunt]] by Joel Spolsky
- 201606 [[file:10-lessons-from-10-years-of-aws.org][10 Lessons from 10 Years of Amazon Web Services]]
- 201606 [[file:republic-and-democracy.org][共和和民主的差别]] on zhihu
- 201606 [[file:religulous.org][Religulous]] by Bill Maher
- 201606 [[file:how-gfw-discovers-hidden-circumvention-servers.org][32c3-7196-en-How_the_Great_Firewall_discovers_hidden_circumvention_servers]] GFW如何发现代理服务器
- 201606 [[file:a-person-of-fidget.org][心中的邪火]] 关于自己的心态失衡
- 201606 [[file:anaconda-high-perf-solution.org][Anacoda High Performance Solution]]
- 201605 [[file:work-efficiently-in-facebook.org][Facebook公司内部PPT分享:如何高效工作]]
- 201605 [[file:on-career-and-management.org][关于工作年限和管理的问题]] by nullgate
- 201605 [[file:notes-on-side-project.org][个人开发者接私活的要点]]
- 201605 [[file:pf-thoughts-on-cn.org][pf写的回国感受]]
- 201605 [[file:you-should-be-with-ambitious-people.org][要与野心人为伍]]
- 201605 [[file:talk-with-lizhi-tech-team.org][专访荔枝fm技术团队]]
- 201605 [[file:play-stock-in-vc-way.org][用VC的方法炒股票]]
- 201605 [[file:true-history-of-google-cn.org][傲慢与偏见之 - 谷歌中国逆袭史]]
- 201605 [[file:how-env-impacts-on-person.org][环境于个人的影响]]
- 201605 [[file:tour-of-google-beijing.org][参观Google北京]]
- 201604 [[https://www.evernote.com/shard/s81/sh/74babb59-ffb0-4858-a8e2-c157b973b7d1/b43c2ee7fc50363efb47daba78a9d59e][Facebook上最近传开了一组漫画，深深戳中咱中国家庭的痛点]] (学会做一个合格的父母)
- 201604 [[file:squid-https-forwarding-proxy.org][用squid做http/https正向代理]]
- 201604 [[file:why-i-work-remotely-hint-it-has-nothing-to-do-with-productivity.org][Why I work remotely (hint: it has nothing to do with productivity).]]
- 201604 [[file:starters-and-maintainers.org][Starters and Maintainers]]
- 201604 [[file:automate-to-save-mental-energy-not-time.org][Automate to save mental energy, not time]]
- 201604 [[file:surviving-meetings-while-remote.org][Surviving meetings while remote]]
- 201604 [[file:programmers-are-distraction-for-your-startup.org][Programmers are distraction for your startup]]
- 201604 [[file:finding-great-developers.org][Finding Great Developers]]
- 201604 [[file:why-cant-programmers-program.org][Why Can't Programmers.. Program?]]
- 201604 [[file:dont-call-yourself-a-programmer.org][Don't Call Yourself A Programmer]]
- 201604 [[file:data-infra-at-airbnb.org][Data Infrastructure at Airbnb]]
- 201604 [[file:atlassian-user-onboarding-magic.org][Atlassian $5.5b user onboarding magic]]
- 201604 [[file:authority-and-merit.org][Authority & Merit]]
- 201604 [[file:nginx-forwarding-proxy.org][nginx正向代理]]
- 201603 [[file:several-waters.org][纯水，软水，净水]]
- 201603 [[file:nginx-site-redirect.org][nginx站点跳转]]
- 201603 [[file:aws-ec2-instances.org][aws ec2的几种实例]]
- 201603 [[file:mac-root-certification.org][mac根证书信任]]
- 201603 [[file:python-universal-feed-parser.org][python universal feed parser]]
- 201603 [[file:python-gzip-input-stream-impl.org][Python Gzip Input Stream 实现]]
- 201602 [[file:got6-is-coming.org][GOT6 is coming]]
- 201602 [[file:a-possible-impl-of-abtest-sys.org][关于AB Test使用和实现的猜测]]
- 201602 [[file:discussion-on-rs.org][记一次推荐系统讨论]]
- 201602 [[file:pieces-of-advice-from-yq.org][前辈给我的建议]]
- 201602 [[file:experience-of-running-coffee-shop-for-40-years.org][开四十年咖啡店是种什么样的体验]]
- 201602 [[file:jianshu-captcha.org][简书的captcha]]
- 201602 [[file:build-nginx-from-source-on-ubuntu.org][build nginx from source on ubuntu]]
- 201602 [[file:big-data-is-supposed-to-be.org][大数据应该是...]]
- 201601 [[file:github-maintenance.org][Github Maintenance]]
- 201601 [[file:reversed-bollinger-band.org][reversed bollinger band]]
- 201601 [[file:on-computational-investing.org][on computational investing]]
- 201601 [[file:calm-down-for-a-second.org][Calm Down For a Second]]
- 201601 [[file:coursera-maintenance.org][Coursera Maintenance]]
- 201601 [[file:stock-price-data-sanity.org][Stock price data sanity]]

