html/blogs.html

<div id="outline-container-org27b1804" class="outline-2">
<h2 id="org27b1804"><span class="section-number-2">4</span> 2016</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>201612 <a href="face-landmark-detection-dlib.html">dlib's face landmark detection</a></li>
<li>201612 <a href="tensorflow-neural-art.html">Tensorflow Neural Art</a></li>
<li>201610 <a href="the-times-they-are-changing.html">The Times They Are A-Changin'</a> by Bob Dylan</li>
<li>201610 <a href="level-up-lang-taste.html">讲一件提升语言格调的小事</a></li>
<li>201610 <a href="the-effective-engineer-by-edmond-lau.html">The Effective Engineer</a></li>
<li>201610 <a href="taking-php-seriously.html">Taking PHP Seriously</a></li>
<li>201610 <a href="becoming-cto.html">Becoming CTO</a></li>
<li>201610 <a href="purchase-on-rapidssl.html">在RapidSSL上购买SSL证书</a></li>
<li>201610 <a href="vinod-khosla-talk.html">Vinod Khosla: Failure does not matter. Success matters.</a></li>
<li>201610 <a href="silicon-valley-etiquette.html">Silicon Valley Etiquette</a> 硅谷礼仪</li>
<li>201610 <a href="chengdu-travel.html">天府之旅</a></li>
<li>201609 <a href="mxnet-neural-art.html">MXNet Neural Art</a></li>
<li>201609 <a href="a-little-architecture.html">A Little Architecture</a></li>
<li>201609 <a href="laws-of-performant-software.html">Laws of Performant Software</a></li>
<li>201609 <a href="build-hls-server.html">搭建直播平台</a></li>
<li>201609 <a href="stackoverflow-maintenance.html">StackOverflow Maintenance</a></li>
<li>201609 <a href="yy-live-on-parenting.html">@杨樾杨樾 老师的育儿直播</a></li>
<li>201608 <a href="some-non-casual-thoughts.html">一些想法（关于工作，人生，以及最近做的梦)</a></li>
<li>201608 <a href="the-future-of-programming.html">The Future of Programming</a> by Bret Victor</li>
<li>201608 <a href="what-makes-a-great-software-engineer.html">What Makes A Great Software Engineer?</a></li>
<li>201607 <a href="https://www.evernote.com/shard/s81/sh/b4dc1995-8028-4552-af4c-2696be08fce8/eb429ff5192222c2dce47aa95f0f5766">你不需要忙，你只需要坚持就够了</a> by 汤小小</li>
<li>201607 <a href="life-is-just-a-moment.html">Life is just a Moment</a></li>
<li>201607 <a href="cool-retro-term.html">Cool Retro Term(CRT)</a> 复古终端:D</li>
<li>201607 <a href="spam-from-apple.html">来自Apple的垃圾邮件</a></li>
<li>201606 <a href="america-alone-talk.html">只剩美国:我们眼睁睁看着末日的降临</a></li>
<li>201606 <a href="top-10-things-that-makes-you-a-good-programmer.html">Top 10 Things that Makes You a Good Programmer</a></li>
<li>201606 <a href="dont-know-what-to-program.html">"I know how to program, but I don't know what to program"</a></li>
<li>201606 <a href="how-to-pick-your-battles-on-a-software-team.html">How to Pick Your Battles on a Software Team</a></li>
<li>201606 <a href="why-mit-stopped-teaching-SICP.html">为什么MIT停止教授SICP</a></li>
<li>201606 <a href="trap-of-startup-side-project.html">軟體工程師的創業陷阱-接案</a></li>
<li>201606 <a href="on-facebook-newsfeed.html">Facebook NewsFeed</a></li>
<li>201606 <a href="getting-things-done-when-you-are-only-a-grunt.html">Getting Things Done When You're Only a Grunt</a> by Joel Spolsky</li>
<li>201606 <a href="10-lessons-from-10-years-of-aws.html">10 Lessons from 10 Years of Amazon Web Services</a></li>
<li>201606 <a href="republic-and-democracy.html">共和和民主的差别</a> on zhihu</li>
<li>201606 <a href="religulous.html">Religulous</a> by Bill Maher</li>
<li>201606 <a href="how-gfw-discovers-hidden-circumvention-servers.html">32c3-7196-en-How<sub>the</sub><sub>Great</sub><sub>Firewall</sub><sub>discovers</sub><sub>hidden</sub><sub>circumvention</sub><sub>servers</sub></a> GFW如何发现代理服务器</li>
<li>201606 <a href="a-person-of-fidget.html">心中的邪火</a> 关于自己的心态失衡</li>
<li>201606 <a href="anaconda-high-perf-solution.html">Anacoda High Performance Solution</a></li>
<li>201605 <a href="work-efficiently-in-facebook.html">Facebook公司内部PPT分享:如何高效工作</a></li>
<li>201605 <a href="on-career-and-management.html">关于工作年限和管理的问题</a> by nullgate</li>
<li>201605 <a href="notes-on-side-project.html">个人开发者接私活的要点</a></li>
<li>201605 <a href="pf-thoughts-on-cn.html">pf写的回国感受</a></li>
<li>201605 <a href="you-should-be-with-ambitious-people.html">要与野心人为伍</a></li>
<li>201605 <a href="talk-with-lizhi-tech-team.html">专访荔枝fm技术团队</a></li>
<li>201605 <a href="play-stock-in-vc-way.html">用VC的方法炒股票</a></li>
<li>201605 <a href="true-history-of-google-cn.html">傲慢与偏见之 - 谷歌中国逆袭史</a></li>
<li>201605 <a href="how-env-impacts-on-person.html">环境于个人的影响</a></li>
<li>201605 <a href="tour-of-google-beijing.html">参观Google北京</a></li>
<li>201604 <a href="https://www.evernote.com/shard/s81/sh/74babb59-ffb0-4858-a8e2-c157b973b7d1/b43c2ee7fc50363efb47daba78a9d59e">Facebook上最近传开了一组漫画，深深戳中咱中国家庭的痛点</a> (学会做一个合格的父母)</li>
<li>201604 <a href="squid-https-forwarding-proxy.html">用squid做http/https正向代理</a></li>
<li>201604 <a href="why-i-work-remotely-hint-it-has-nothing-to-do-with-productivity.html">Why I work remotely (hint: it has nothing to do with productivity).</a></li>
<li>201604 <a href="starters-and-maintainers.html">Starters and Maintainers</a></li>
<li>201604 <a href="automate-to-save-mental-energy-not-time.html">Automate to save mental energy, not time</a></li>
<li>201604 <a href="surviving-meetings-while-remote.html">Surviving meetings while remote</a></li>
<li>201604 <a href="programmers-are-distraction-for-your-startup.html">Programmers are distraction for your startup</a></li>
<li>201604 <a href="finding-great-developers.html">Finding Great Developers</a></li>
<li>201604 <a href="why-cant-programmers-program.html">Why Can't Programmers.. Program?</a></li>
<li>201604 <a href="dont-call-yourself-a-programmer.html">Don't Call Yourself A Programmer</a></li>
<li>201604 <a href="data-infra-at-airbnb.html">Data Infrastructure at Airbnb</a></li>
<li>201604 <a href="atlassian-user-onboarding-magic.html">Atlassian $5.5b user onboarding magic</a></li>
<li>201604 <a href="authority-and-merit.html">Authority &amp; Merit</a></li>
<li>201604 <a href="nginx-forwarding-proxy.html">nginx正向代理</a></li>
<li>201603 <a href="several-waters.html">纯水，软水，净水</a></li>
<li>201603 <a href="nginx-site-redirect.html">nginx站点跳转</a></li>
<li>201603 <a href="aws-ec2-instances.html">aws ec2的几种实例</a></li>
<li>201603 <a href="mac-root-certification.html">mac根证书信任</a></li>
<li>201603 <a href="python-universal-feed-parser.html">python universal feed parser</a></li>
<li>201603 <a href="python-gzip-input-stream-impl.html">Python Gzip Input Stream 实现</a></li>
<li>201602 <a href="got6-is-coming.html">GOT6 is coming</a></li>
<li>201602 <a href="a-possible-impl-of-abtest-sys.html">关于AB Test使用和实现的猜测</a></li>
<li>201602 <a href="discussion-on-rs.html">记一次推荐系统讨论</a></li>
<li>201602 <a href="pieces-of-advice-from-yq.html">前辈给我的建议</a></li>
<li>201602 <a href="experience-of-running-coffee-shop-for-40-years.html">开四十年咖啡店是种什么样的体验</a></li>
<li>201602 <a href="jianshu-captcha.html">简书的captcha</a></li>
<li>201602 <a href="build-nginx-from-source-on-ubuntu.html">build nginx from source on ubuntu</a></li>
<li>201602 <a href="big-data-is-supposed-to-be.html">大数据应该是&#x2026;</a></li>
<li>201601 <a href="github-maintenance.html">Github Maintenance</a></li>
<li>201601 <a href="reversed-bollinger-band.html">reversed bollinger band</a></li>
<li>201601 <a href="on-computational-investing.html">on computational investing</a></li>
<li>201601 <a href="calm-down-for-a-second.html">Calm Down For a Second</a></li>
<li>201601 <a href="coursera-maintenance.html">Coursera Maintenance</a></li>
<li>201601 <a href="stock-price-data-sanity.html">Stock price data sanity</a></li>
</ul>
</div>
</div>
