src/blogs.org
** 2015
- 201512 [[file:ms-presentation.org][Michael Stonebraker Presentation]]
- 201512 [[file:how-to-launch-a-mac-app-and-become-1-top-paid-app-globally.org][How To Launch a Mac App and Become #1 Top Paid App Globally]]
- 201512 [[file:what-would-it-take-to-prove-me-wrong.org][What would it take to prove me wrong?]]
- 201512 [[file:a-great-developer-can-come-from-anywhere.org][A great developer can come from anywhere]]
- 201512 [[file:employee-equity.org][Employee Equity]] Sam Altman关于员工期权的文章.
- 201512 [[file:before-you-code-write.org][Before you code, write.]]
- 201512 [[file:remove-the-stress-pick-a-deadline.org][Remove the stress, pick a deadline]]
- 201512 [[file:the-secret-to-career-success.org][The Secret to Career Success]]
- 201512 [[file:the-scientist.org][The Scientist]]
- 201511 [[file:ios-device-and-screenshot-size.org][iOS设备与屏幕分辨率对应关系]]
- 201511 [[file:a-note-of-nobel-winner.org][石墨烯教父: 从千年博后到物理诺奖的心路历程]]
- 201511 [[file:why-i-stopped-paying-attention-to-industry-news.org][Why I stopped paying attention to industry news]]
- 201510 [[file:learn-stop-using-shiny-new-things-and-love-mysql.org][Learn to stop using shiny new things and love MySQL]]
- 201510 [[file:climbing-the-wrong-hill.org][Climbing The Wrong Hill]]
- 201510 [[file:lessons-learned-writing-highly-available-code.org][Lessons learned writing highly available code]]
- 201510 [[file:dont-base-your-business-on-a-paid-app.org][Don't base your business on a paid app]]
- 201510 [[file:some-advice-from-jeff-bezos.org][Some advice from Jeff Bezos]]
- 201510 [[file:ten-rules-for-open-source-success.org][Ten Rules for Open Source Success]]
- 201510 [[file:competitors-are-not-the-enemy.org][Competitors Are Not The Enemy]]
- 201510 [[file:making-money-along-the-way.org][Making money along the way]]
- 201510 [[file:staying-healthy-while-working-remotely.org][远程工作者如何保持健康]]
- 201510 [[file:real-life-of-startup-with-baby.org][带着娃创业的真实一面]]
- 201510 [[file:a-impl-of-my-dict-book.org][一个生词本的实现]]
- 201510 [[file:chasing-the-shiny-and-new.org][chasing the shiny and new (追逐时髦的技术)]]
- 201510 [[file:why-cd-just-keeps-on-giving.org][Why Continuous Deployment just keeps on giving]]
- 201510 [[file:how-to-get-a-job-like-mine-aaron-swartz.org][Aaron Swartz: How to Get a Job Like Mine]]
- 201510 [[file:a-decade-at-google.org][A Decade at Google]]
- 201510 [[file:dont-switch-to-yinxiang-note.org][切换到印象笔记-NO!]]
- 201509 [[file:ostep-persist-file.org][OSTEP / Persistence-File]]
- 201509 [[file:ostep-persist-disk.org][OSTEP / Persistence-Disk]]
- 201509 [[file:ostep-con-cv.org][OSTEP / Concurrency-CV]]
- 201509 [[file:ostep-con-lock.org][OSTEP / Concurrency-Lock]]
- 201509 [[file:hive-getting-started.org][hive getting started]]
- 201509 [[file:zookeeper-getting-started.org][zookeeper getting started]]
- 201509 [[file:ostep-virt-vax-vms.org][OSTEP / Virt-VAX/VMS]]
- 201509 [[file:ostep-virt-vm-page.org][OSTEP / Virt-页式系统]]
- 201509 [[file:ostep-virt-vm-seg.org][OSTEP / Virt-段式系统]]
- 201509 [[file:ostep-virt-cpu.org][OSTEP / Virt-CPU]]
- 201509 [[file:ostep-readings.org][OSTEP / Readings]]
- 201509 [[file:a-love-for-legacy.org][A Love for Legacy]]
- 201509 [[file:availability-vs-durability.org][Availability vs. Durability]]
- 201509 [[file:2pc-vs-paxos.org][2PC vs. Paxos]]
- 201509 [[file:central-limit-theorem.org][中心极限定理]]
- 201509 [[file:spark-master-ui.org][spark master ui]]
- 201509 [[file:what-happens-to-older-developers.org][What Happens to Older Developers?]]
- 201509 [[file:tips-for-work-life-balance.org][Tips for work-life balance]]
- 201509 [[file:start-from-simple.org][start from simple]]
- 201508 [[file:you-know-so-little.org][其实你知道的太少]]
- 201507 [[file:have-a-baby.org][宝宝出生了]]
- 201505 [[file:equipped-with-ssd.org][装配SSD]]
- 201504 [[file:kaggle-facial-keypoints-detection.org][Kaggle Facial Keypoints Detection]]
- 201504 [[file:kaggle-digit-recongnizer.org][Kaggle Digit Recognizer]]
- 201504 [[file:life-is-not-easy-but-magical.org][life is not easy but magical]]
- 201503 [[file:how-to-do-cross-validation.org][如何做cross validation]]
- 201503 [[file:kaggle-bike-sharing-demand.org][Kaggle Bike Sharing Demand]]
- 201503 [[file:principle-of-alloc-time-for-work.org][分配工作时间的准则]]
- 201502 [[file:how-to-choose-baseline.org][选用什么方法做baseline]]
- 201502 [[file:2015-house-clean.org][2015家庭大扫除]]
- 201502 [[file:do-house-work-as-leisure.org][有空多干点家务活]]
- 201502 [[file:you-cant-read-all-books.org][书是读不过来的]]
- 201502 [[file:peter-thiel-on-competition-obsession.org][Peter Thiel 谈竞争沉迷]]
- 201502 [[file:telstra-billboard-of-love.org][Telstra BB]]

** 2014
- 201412 [[file:the-golden-circle.org][The Golden Circle]]
- 201412 [[file:about-dna-sequencing.org][DNA测序原理]]
- 201412 [[file:beginning-of-a-hard-journey.org][苦旅的起点]]
- 201410 [[file:my-iphone5s.org][我的iPhone5S]]
- 201409 [[file:helsinki-travel2.org][赫尔辛基印象2]]
- 201408 [[file:jeju-travel.org][济州岛之旅]]
- 201407 [[file:xmn-travel.org][厦门鼓浪屿印象]]
- 201404 [[file:sfo-travel.org][旧金山印象]]
- 201403 [[file:helsinki-travel.org][赫尔辛基印象]]
- 201403 [[file:apply-visa-for-usa.org][申请美国签证]]
- 201402 [[file:apply-visa-for-finland.org][申请芬兰签证]]
- 201402 [[file:mobile-foreign-business.org][手机国际业务]]
- 201402 [[file:cmb-hk-account.org][招商银行香港一卡通]]
- 201401 [[file:talk-with-nenad.org][与Nenad面对面]]

** 2013
- 201312 [[file:have-a-nice-sleep-and-straighten-up.org][哪里还有时间去沮丧]]
- 201312 [[file:thousands-pv.org][主页千次PV]]
- 201311 [[file:heart-broken.org][为她心碎]]
- 201311 [[file:professional-amateur.org][非业余的业余爱好]]
- 201311 [[file:my-first-english-conversation.org][初次英语对话]]
- 201310 [[file:my-first-moxa-wool-moxibustion.org][初次艾灸]]
- 201310 [[file:run-wordpress-in-fast-way.org][简单搭建WordPress]]
- 201309 [[file:do-we-need-exercise.org][我们是否需要运动]]
- 201309 [[file:first-10km-running.org][初次10km跑]]
- 201308 [[file:first-swimming.org][初次游泳]]
- 201307 [[file:guilin-travel.org][桂林山水]]
- 201307 [[file:ymy-travel.org][圆明园游]]
- 201307 [[file:my-amoi-n821.org][我的夏新N821]]
- 201306 [[file:unecessary-hurry-up.org][急得蛋碎了也没有用]]
- 201306 [[file:meeting-dyq.org][做CTO都是出去过的]]
- 201306 [[file:goodbye-dyy.org][朋友远行，一路顺风]]
- 201305 [[file:be-careful-when-you-drive.org][小心开车]]
- 201303 [[file:ms-interview.org][微软面试]]
- 201302 [[file:my-without-wife-wedding.org][没有妻子的婚礼]]

