html/blogs.html

<div id="outline-container-org87e0dc1" class="outline-2">
<h2 id="org87e0dc1"><span class="section-number-2">5</span> 2015</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>201512 <a href="ms-presentation.html">Michael Stonebraker Presentation</a></li>
<li>201512 <a href="how-to-launch-a-mac-app-and-become-1-top-paid-app-globally.html">How To Launch a Mac App and Become #1 Top Paid App Globally</a></li>
<li>201512 <a href="what-would-it-take-to-prove-me-wrong.html">What would it take to prove me wrong?</a></li>
<li>201512 <a href="a-great-developer-can-come-from-anywhere.html">A great developer can come from anywhere</a></li>
<li>201512 <a href="employee-equity.html">Employee Equity</a> Sam Altman关于员工期权的文章.</li>
<li>201512 <a href="before-you-code-write.html">Before you code, write.</a></li>
<li>201512 <a href="remove-the-stress-pick-a-deadline.html">Remove the stress, pick a deadline</a></li>
<li>201512 <a href="the-secret-to-career-success.html">The Secret to Career Success</a></li>
<li>201512 <a href="the-scientist.html">The Scientist</a></li>
<li>201511 <a href="ios-device-and-screenshot-size.html">iOS设备与屏幕分辨率对应关系</a></li>
<li>201511 <a href="a-note-of-nobel-winner.html">石墨烯教父: 从千年博后到物理诺奖的心路历程</a></li>
<li>201511 <a href="why-i-stopped-paying-attention-to-industry-news.html">Why I stopped paying attention to industry news</a></li>
<li>201510 <a href="learn-stop-using-shiny-new-things-and-love-mysql.html">Learn to stop using shiny new things and love MySQL</a></li>
<li>201510 <a href="climbing-the-wrong-hill.html">Climbing The Wrong Hill</a></li>
<li>201510 <a href="lessons-learned-writing-highly-available-code.html">Lessons learned writing highly available code</a></li>
<li>201510 <a href="dont-base-your-business-on-a-paid-app.html">Don't base your business on a paid app</a></li>
<li>201510 <a href="some-advice-from-jeff-bezos.html">Some advice from Jeff Bezos</a></li>
<li>201510 <a href="ten-rules-for-open-source-success.html">Ten Rules for Open Source Success</a></li>
<li>201510 <a href="competitors-are-not-the-enemy.html">Competitors Are Not The Enemy</a></li>
<li>201510 <a href="making-money-along-the-way.html">Making money along the way</a></li>
<li>201510 <a href="staying-healthy-while-working-remotely.html">远程工作者如何保持健康</a></li>
<li>201510 <a href="real-life-of-startup-with-baby.html">带着娃创业的真实一面</a></li>
<li>201510 <a href="a-impl-of-my-dict-book.html">一个生词本的实现</a></li>
<li>201510 <a href="chasing-the-shiny-and-new.html">chasing the shiny and new (追逐时髦的技术)</a></li>
<li>201510 <a href="why-cd-just-keeps-on-giving.html">Why Continuous Deployment just keeps on giving</a></li>
<li>201510 <a href="how-to-get-a-job-like-mine-aaron-swartz.html">Aaron Swartz: How to Get a Job Like Mine</a></li>
<li>201510 <a href="a-decade-at-google.html">A Decade at Google</a></li>
<li>201510 <a href="dont-switch-to-yinxiang-note.html">切换到印象笔记-NO!</a></li>
<li>201509 <a href="ostep-persist-file.html">OSTEP / Persistence-File</a></li>
<li>201509 <a href="ostep-persist-disk.html">OSTEP / Persistence-Disk</a></li>
<li>201509 <a href="ostep-con-cv.html">OSTEP / Concurrency-CV</a></li>
<li>201509 <a href="ostep-con-lock.html">OSTEP / Concurrency-Lock</a></li>
<li>201509 <a href="hive-getting-started.html">hive getting started</a></li>
<li>201509 <a href="zookeeper-getting-started.html">zookeeper getting started</a></li>
<li>201509 <a href="ostep-virt-vax-vms.html">OSTEP / Virt-VAX/VMS</a></li>
<li>201509 <a href="ostep-virt-vm-page.html">OSTEP / Virt-页式系统</a></li>
<li>201509 <a href="ostep-virt-vm-seg.html">OSTEP / Virt-段式系统</a></li>
<li>201509 <a href="ostep-virt-cpu.html">OSTEP / Virt-CPU</a></li>
<li>201509 <a href="ostep-readings.html">OSTEP / Readings</a></li>
<li>201509 <a href="a-love-for-legacy.html">A Love for Legacy</a></li>
<li>201509 <a href="availability-vs-durability.html">Availability vs. Durability</a></li>
<li>201509 <a href="2pc-vs-paxos.html">2PC vs. Paxos</a></li>
<li>201509 <a href="central-limit-theorem.html">中心极限定理</a></li>
<li>201509 <a href="spark-master-ui.html">spark master ui</a></li>
<li>201509 <a href="what-happens-to-older-developers.html">What Happens to Older Developers?</a></li>
<li>201509 <a href="tips-for-work-life-balance.html">Tips for work-life balance</a></li>
<li>201509 <a href="start-from-simple.html">start from simple</a></li>
<li>201508 <a href="you-know-so-little.html">其实你知道的太少</a></li>
<li>201507 <a href="have-a-baby.html">宝宝出生了</a></li>
<li>201505 <a href="equipped-with-ssd.html">装配SSD</a></li>
<li>201504 <a href="kaggle-facial-keypoints-detection.html">Kaggle Facial Keypoints Detection</a></li>
<li>201504 <a href="kaggle-digit-recongnizer.html">Kaggle Digit Recognizer</a></li>
<li>201504 <a href="life-is-not-easy-but-magical.html">life is not easy but magical</a></li>
<li>201503 <a href="how-to-do-cross-validation.html">如何做cross validation</a></li>
<li>201503 <a href="kaggle-bike-sharing-demand.html">Kaggle Bike Sharing Demand</a></li>
<li>201503 <a href="principle-of-alloc-time-for-work.html">分配工作时间的准则</a></li>
<li>201502 <a href="how-to-choose-baseline.html">选用什么方法做baseline</a></li>
<li>201502 <a href="2015-house-clean.html">2015家庭大扫除</a></li>
<li>201502 <a href="do-house-work-as-leisure.html">有空多干点家务活</a></li>
<li>201502 <a href="you-cant-read-all-books.html">书是读不过来的</a></li>
<li>201502 <a href="peter-thiel-on-competition-obsession.html">Peter Thiel 谈竞争沉迷</a></li>
<li>201502 <a href="telstra-billboard-of-love.html">Telstra BB</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9220a58" class="outline-2">
<h2 id="org9220a58"><span class="section-number-2">6</span> 2014</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>201412 <a href="the-golden-circle.html">The Golden Circle</a></li>
<li>201412 <a href="about-dna-sequencing.html">DNA测序原理</a></li>
<li>201412 <a href="beginning-of-a-hard-journey.html">苦旅的起点</a></li>
<li>201410 <a href="my-iphone5s.html">我的iPhone5S</a></li>
<li>201409 <a href="helsinki-travel2.html">赫尔辛基印象2</a></li>
<li>201408 <a href="jeju-travel.html">济州岛之旅</a></li>
<li>201407 <a href="xmn-travel.html">厦门鼓浪屿印象</a></li>
<li>201404 <a href="sfo-travel.html">旧金山印象</a></li>
<li>201403 <a href="helsinki-travel.html">赫尔辛基印象</a></li>
<li>201403 <a href="apply-visa-for-usa.html">申请美国签证</a></li>
<li>201402 <a href="apply-visa-for-finland.html">申请芬兰签证</a></li>
<li>201402 <a href="mobile-foreign-business.html">手机国际业务</a></li>
<li>201402 <a href="cmb-hk-account.html">招商银行香港一卡通</a></li>
<li>201401 <a href="talk-with-nenad.html">与Nenad面对面</a></li>
</ul>
</div>
</div>

<div id="outline-container-org353a0c6" class="outline-2">
<h2 id="org353a0c6"><span class="section-number-2">7</span> 2013</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>201312 <a href="have-a-nice-sleep-and-straighten-up.html">哪里还有时间去沮丧</a></li>
<li>201312 <a href="thousands-pv.html">主页千次PV</a></li>
<li>201311 <a href="heart-broken.html">为她心碎</a></li>
<li>201311 <a href="professional-amateur.html">非业余的业余爱好</a></li>
<li>201311 <a href="my-first-english-conversation.html">初次英语对话</a></li>
<li>201310 <a href="my-first-moxa-wool-moxibustion.html">初次艾灸</a></li>
<li>201310 <a href="run-wordpress-in-fast-way.html">简单搭建WordPress</a></li>
<li>201309 <a href="do-we-need-exercise.html">我们是否需要运动</a></li>
<li>201309 <a href="first-10km-running.html">初次10km跑</a></li>
<li>201308 <a href="first-swimming.html">初次游泳</a></li>
<li>201307 <a href="guilin-travel.html">桂林山水</a></li>
<li>201307 <a href="ymy-travel.html">圆明园游</a></li>
<li>201307 <a href="my-amoi-n821.html">我的夏新N821</a></li>
<li>201306 <a href="unecessary-hurry-up.html">急得蛋碎了也没有用</a></li>
<li>201306 <a href="meeting-dyq.html">做CTO都是出去过的</a></li>
<li>201306 <a href="goodbye-dyy.html">朋友远行，一路顺风</a></li>
<li>201305 <a href="be-careful-when-you-drive.html">小心开车</a></li>
<li>201303 <a href="ms-interview.html">微软面试</a></li>
<li>201302 <a href="my-without-wife-wedding.html">没有妻子的婚礼</a></li>
</ul>
</div>
</div>
